{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"activity_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "name": "dense_144", "kernel_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 8], "units": 6, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "name": "dense_145", "units": 3, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "name": "dense_146", "units": 2, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "name": "dense_147", "units": 1, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null}}], "keras_version": "2.2.2"}